/*
JSON (JavaScript Object Notation)은 속성-값 쌍, 키-값 쌍으로 이루어진 
데이터 오브젝트를 전달하기 위해 인간이 읽을 수 있는 텍스트를 사용하는 
개방형 표준 포맷이다.
배열은 대괄호[]로 나타낸다. 배열의 각 요소는 기본 자료형이거나 배열, 객체이다
객체는 이름/값 쌍의 집합으로, 중괄호{}를 사용한다. 
예제) 
 {
    "이름": "홍길동",
    "나이": 25,
    "성별": "여",
    "주소": "서울특별시 양천구 목동",
    "특기": ["농구", "도술"],
    "가족관계": {"#": 2, "아버지": "홍판서", "어머니": "춘섬"},
    "회사": "경기 수원시 팔달구 우만동"
 }
*/
// 다양한 형식
// - {"이름" : 데이터}
// - {"이름" : 데이터, "이름" : 데이터, "이름" : 데이터 }
// - [{"이름" : 데이터}, {"이름" : 데이터}, {"이름" : 데이터}]
// - {"이름" : 데이터", "이름" : [{"이름" : 데이터}, {"이름" : 데이터}] }
[{"name" : "콜라", "price" : "750"},
 {"name" : "사이다", "price" : "850"}, 	
 {"name" : "환타", "price" : "750"},
 {"name" : "맥콜", "price" : "950"}]

   






